In [3]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [4]:
train_data = pd.read_csv('Resources/train.csv')
test_data = pd.read_csv('Resources/test.csv')
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
train_data.shape

(891, 12)

In [7]:
train_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [97]:
null_columns=train_data.columns[train_data.isnull().any()]

display(train_data[train_data["Embarked"].isnull()])

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Sex, Age, SibSp, Parch, Fare, Embarked]
Index: []

In [98]:
null_columns

Index([], dtype='object')

In [99]:
train_data["Embarked"] = train_data["Embarked"].fillna(method='ffill')

In [100]:
train_data.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64

In [64]:
train_data.drop(labels='Name', axis=1, inplace=True)

In [65]:
train_data.drop(labels='Cabin', axis=1, inplace=True)

In [66]:
# Use Pandas get_dummies to convert categorical data

### BEGIN SOLUTION
train_data_2 = pd.get_dummies(train_data['Sex'])
train_data_2.shape

(891, 2)

In [67]:
cleanup_nums = {"Sex":     {"male": 0, "female": 1}}

In [68]:
train_data.replace(cleanup_nums, inplace=True)

In [69]:
train_data.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,0,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,1,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,1,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,1,35.0,1,0,113803,53.1000,S
4,5,0,3,0,35.0,0,0,373450,8.0500,S

In [70]:
train_data['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [71]:
cleanup_nums_2 = {"Embarked":     {"S": 0, "C": 1, 'Q': '2'}}

In [72]:
train_data.replace(cleanup_nums_2, inplace=True)

In [73]:
train_data.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,0,22.0,1,0,A/5 21171,7.2500,0
1,2,1,1,1,38.0,1,0,PC 17599,71.2833,1
2,3,1,3,1,26.0,0,0,STON/O2. 3101282,7.9250,0
3,4,1,1,1,35.0,1,0,113803,53.1000,0
4,5,0,3,0,35.0,0,0,373450,8.0500,0

In [74]:
train_data.drop(labels='Ticket', axis=1, inplace=True)

In [75]:
train_data.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    0  22.0      1      0   7.2500        0
1            2         1       1    1  38.0      1      0  71.2833        1
2            3         1       3    1  26.0      0      0   7.9250        0
3            4         1       1    1  35.0      1      0  53.1000        0
4            5         0       3    0  35.0      0      0   8.0500        0

In [76]:
train_data.dropna(inplace=True)

In [77]:
test = train_data.drop(labels='Survived', axis=1)

In [78]:
test.head()


test.shape

(714, 8)

In [79]:
target = train_data['Survived']



target.shape

(714,)

In [80]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(test, target, random_state=42)

In [81]:
X_train.shape

(535, 8)

In [82]:
X_test.shape

(179, 8)

In [83]:
from sklearn import tree

clf = tree.DecisionTreeClassifier()
clf = clf.fit(X_train, y_train)
clf.score(X_test, y_test)

0.7150837988826816

In [84]:
#Attempt 2

train_data.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    0  22.0      1      0   7.2500        0
1            2         1       1    1  38.0      1      0  71.2833        1
2            3         1       3    1  26.0      0      0   7.9250        0
3            4         1       1    1  35.0      1      0  53.1000        0
4            5         0       3    0  35.0      0      0   8.0500        0

In [85]:
train_data_2 = train_data.drop(labels='PassengerId', axis=1)

In [86]:
train_data_2.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    0  22.0      1      0   7.2500        0
1         1       1    1  38.0      1      0  71.2833        1
2         1       3    1  26.0      0      0   7.9250        0
3         1       1    1  35.0      1      0  53.1000        0
4         0       3    0  35.0      0      0   8.0500        0

In [87]:
train_data_2.shape

(714, 8)

In [88]:
train_data_2.to_csv("AG_train-test.csv")

In [89]:
test_2 = train_data_2.drop(labels='Survived', axis=1)

target_2 = train_data_2['Survived']

In [90]:
test_2.shape

(714, 7)

In [91]:
target_2.shape

(714,)

In [92]:

X_train_2, X_test_2, y_train_2, y_test_2 = train_test_split(test_2, target_2, random_state=42)

In [93]:
clf = clf.fit(X_train_2, y_train_2)
clf.score(X_test_2, y_test_2)

0.7541899441340782